[
    {
        "id": 84,
        "img": "/images/croissant.jpg",
        "title": "Croissant",
        "kcal":"405 kcal",
    "link":"https://sallysbakingaddiction.com/homemade-croissants/",
        "isFavorite": false,
        "description": "The epitome of flaky, buttery perfection that brightens your mornings with every bite.",
        "ingredients": [ "2 1/4 cups all-purpose flour",
        "1/4 cup granulated sugar",
        "1 packet (2 1/4 teaspoons) active dry yeast",
        "1/2 cup warm milk",
        "1/2 cup cold water",
        "1 teaspoon salt",
        "1 cup unsalted butter, cold",
        "1 large egg, beaten (for egg wash)"],
      "steps": [ "In a mixing bowl, combine warm milk, warm water, and sugar. Sprinkle yeast over the mixture and let it sit for 5 minutes until foamy.",
      "Add flour and salt to the yeast mixture. Knead the dough until smooth and elastic. Cover and refrigerate for 1 hour.",
      "Roll out the chilled dough into a rectangle. Place the cold butter in the center and fold the dough over it. Chill for 30 minutes.",
      "Roll and fold the dough several times, then chill again for 30 minutes.",
      "Roll out the dough, cut into triangles, and roll each triangle into a croissant shape.",
      "Place the croissants on a baking sheet, brush with egg wash, and let them rise for 1 hour.",
      "Preheat the oven to 425°F (220°C). Bake the croissants for 15-20 minutes until golden brown. Serve your Croissants."]
    },
    {
        "id":85,
        "kcal":"253 kcal",
    "link":"https://www.vegrecipesofindia.com/eggless-doughnut-recipe-baked-doughnut/",
        "img":"/images/choco over donut.jpg",
        "title":"Choco Donut",
        "isFavorite": false,
        "description":"A chocolate lover's dream come true, a delectable ring of happiness coated in velvety sweetness.",
        "ingredients": ["2 cups all-purpose flour",
        "1/2 cup granulated sugar",
        "1/4 cup cocoa powder",
        "1 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1/2 cup buttermilk",
        "1/4 cup vegetable oil",
        "2 large eggs",
        "1 teaspoon vanilla extract",
        "1/2 cup hot water",
        "Vegetable oil for frying",
        "For glaze: 1 cup powdered sugar, 2 tablespoons cocoa powder, 2 tablespoons milk"],
      "steps": [ "In a mixing bowl, whisk together flour, sugar, cocoa powder, baking powder, baking soda, and salt.",
      "In another bowl, mix buttermilk, vegetable oil, eggs, and vanilla extract.",
      "Combine the wet and dry ingredients, then gradually add hot water. Mix until smooth.",
      "Heat vegetable oil in a deep pan. Drop spoonfuls of batter into the hot oil and fry until golden brown.",
      "Drain on paper towels. For the glaze, mix powdered sugar, cocoa powder, and milk until smooth.",
      "Dip the donuts in the glaze and let them set. Serve your Chocolate Donuts."]
    },
    {
        "id":86,
        "kcal":"395 kcal",
    "link":"https://www.allrecipes.com/recipe/223234/macaron-french-macaroon/",
        "img":"/images/macroon.jpeg",
        "title":"Macaron",
        "isFavorite": false,
        "description":"A delicate French masterpiece, each bite is a burst of vibrant colors and flavors that transport you to Paris.",
        "ingredients": ["1 cup powdered sugar",
        "3/4 cup almond flour",
        "2 large egg whites",
        "1/4 cup granulated sugar",
        "Food coloring (optional)",
        "Filling of your choice (e.g., ganache, buttercream)"],
      "steps": ["Sift powdered sugar and almond flour together. Set aside.",
      "In a mixing bowl, beat egg whites until foamy. Gradually add granulated sugar and beat until stiff peaks form.",
      "Gently fold the sifted dry ingredients into the egg white mixture. Add food coloring if desired.",
      "Pipe the mixture onto a baking sheet into small rounds. Let them rest for 30 minutes until a skin forms.",
      "Preheat the oven to 300°F (150°C). Bake the macarons for 15-20 minutes.",
      "Let them cool, then sandwich with your choice of filling. Serve your Macarons."]
    },
  {
    "id": 87,
    "title": "Ratatouille",
    "kcal":"145 kcal",
    "link":"https://www.allrecipes.com/recipe/18411/ratatouille/",
    "img": "/images/Ratatouille.jpg",
    "isFavorite": false,
    "description":"A rustic Mediterranean delight, a medley of fresh vegetables and herbs that dances on your palate.",
    "ingredients": [   "1 eggplant, diced",
    "2 zucchinis, sliced",
    "1 red bell pepper, diced",
    "1 yellow bell pepper, diced",
    "1 onion, chopped",
    "3 cloves garlic, minced",
    "1 can (14 oz) crushed tomatoes",
    "1 teaspoon dried basil",
    "1 teaspoon dried oregano",
    "Salt and pepper to taste",
    "Olive oil for cooking",
    "Fresh basil leaves for garnish"],
      "steps": ["In a large pan, heat olive oil and sauté onion and garlic until fragrant.",
      "Add diced eggplant, bell peppers, and zucchinis. Cook until they start to soften.",
      "Stir in crushed tomatoes, dried basil, dried oregano, salt, and pepper. Simmer for 15-20 minutes.",
      "Serve your Ratatouille garnished with fresh basil leaves."]
  }
  ]
  